<?php
/**
 * 全局常量定义
 * @author Bily
 * @date 2017-8-7 11:40:20
 */

/*
|--------------------------------------------------------------------------
| 错误号常量表
|--------------------------------------------------------------------------
*/

/**
 * @var int 错误号：成功（无错误）
 */
define('ERROR_OK', 1000);

/**
 * @var int 错误号：访问过于频繁
 */
define('ERROR_TOO_MANY_ATTEMPTS', 429);

/**
 * @var int 错误号：未知错误
 */
define('ERROR_UNKNOWN', 4000);

/**
 * @var int 错误号：未登录或登录状态已超时
 */
define('ERROR_NOT_LOGIN', 4001);

/**
 * @var int 错误号：认证失败
 */
define('ERROR_AUTH_FAILED', 4002);

/**
 * @var int 错误号：数据验证失败
 */
define('ERROR_VALIDATION_FAILED', 4003);

/**
 * @var int 错误号：登录失败
 */
define('ERROR_LOGIN_FAILED', 4004);

/**
 * @var int 错误号：令牌过期
 */
define('ERROR_TOKEN_EXPIRE', 4005);

/**
 * @var int 错误号：令牌无效
 */
define('ERROR_TOKEN_INVALID', 4006);

/**
 * @var int 错误号：令牌数据错误
 */
define('ERROR_TOKEN_BAD', 4007);

/**
 * @var int 错误号：没有权限
 */
define('ERROR_NO_PERMIT', 4008);

/**
 * @var int 错误号：令牌已被黑名单
 */
define('ERROR_TOKEN_BLACKLISTED', 4009);

/*
|--------------------------------------------------------------------------
| 分页常量表
|--------------------------------------------------------------------------
*/

define('PAGE_SIZE', 15);

/*
|--------------------------------------------------------------------------
| 布尔型常量表
|--------------------------------------------------------------------------
*/

/**
 * @var int 布尔值true
 */
define('BOOLEAN_TRUE', 1);

/**
 * @var int 布尔值false
 */
define('BOOLEAN_FALSE', 2);

/*
|--------------------------------------------------------------------------
| 性别
|--------------------------------------------------------------------------
*/

/**
 * @var int 男
 */
define('SEX_MALE', 1);
/**
 * @var int 女
 */
define('SEX_FEMALE', 2);